<template>
  <Table :columns="columns" :dataSource="dataSource" height="160px"/>
</template>

<script>
import Table from "../../modules/table";
export default {
  components: {
    Table
  },
  data() {
    return {
      columns: [
        {title: '区域', dataIndex: '区域'},
        {title: '覆盖总人口', unit: "(万人)", dataIndex: '覆盖总人口'},
        {title: '吸毒前科', unit: "(人)", dataIndex: '吸毒前科'},
        {title: '制毒前科', unit: "(人)", dataIndex: '制毒前科'},
        {title: '高危流入', unit: "(人)", dataIndex: '高危流入'},
      ],
      dataSource: [
        {"区域": "南湖区", "覆盖总人口": "61.27", "吸毒前科": "623", "制毒前科": "582", "高危流入": "561"},
        {"区域": "秀洲区", "覆盖总人口": "58.92", "吸毒前科": "529", "制毒前科": "654", "高危流入": "586"},
        {"区域": "嘉善县", "覆盖总人口": "57.42", "吸毒前科": "462", "制毒前科": "485", "高危流入": "148"},
        {"区域": "平湖市", "覆盖总人口": "67.18", "吸毒前科": "659", "制毒前科": "863", "高危流入": "259"},
        {"区域": "海盐县", "覆盖总人口": "43.09", "吸毒前科": "674", "制毒前科": "475", "高危流入": "482"},
        {"区域": "海宁市", "覆盖总人口": "80.70", "吸毒前科": "782", "制毒前科": "853", "高危流入": "159"},
        {"区域": "桐乡市", "覆盖总人口": "81.58", "吸毒前科": "1005", "制毒前科": "429", "高危流入": "183"},
        {"区域": "经开区", "覆盖总人口": "33.7", "吸毒前科": "538", "制毒前科": "365", "高危流入": "85"},
        {"区域": "港区", "覆盖总人口": "12.35", "吸毒前科": "365", "制毒前科": "259", "高危流入": "56"},
      ]
    }
  }

}
</script>

<style lang="scss" scoped>

</style>
