<template>
  <Table :columns="columns" :dataSource="dataSource" height="200px"/>
</template>

<script>
import Table from "../../modules/table";
export default {
  components: {
    Table
  },
  data() {
    return {
      columns: [
        {title: '区域', dataIndex: '区域'},
        {title: '污水厂', unit: "(家)", dataIndex: '污水厂'},
        {title: '泵站', unit: "(个)", dataIndex: '泵站'},
        {title: '窨井', unit: "(个)", dataIndex: '窨井'},
        {title: '服务人口', unit: "(万人)", dataIndex: '服务人口'},
      ],
      dataSource: [
        {"区域": "嘉善县", "污水厂": "5", "泵站": "36", "窨井": "18926", "服务人口": "40.53"},
        {"区域": "南湖区", "污水厂": "1", "泵站": "23", "窨井": "16526", "服务人口": "52.66"},
        {"区域": "秀洲区", "污水厂": "2", "泵站": "27", "窨井": "17569", "服务人口": "41.18"},
        {"区域": "平湖市", "污水厂": "1", "泵站": "25", "窨井": "15698", "服务人口": "50.32"},
        {"区域": "海盐县", "污水厂": "2", "泵站": "45", "窨井": "14865", "服务人口": "28.29"},
        {"区域": "宁海市", "污水厂": "3", "泵站": "29", "窨井": "16852", "服务人口": "70.25"},
        {"区域": "桐乡市", "污水厂": "1", "泵站": "31", "窨井": "18652", "服务人口": "70.47"},
        {"区域": "经开区", "污水厂": "1", "泵站": "26", "窨井": "9562", "服务人口": "33.7"},
        {"区域": "港区", "污水厂": "1", "泵站": "19", "窨井": "8568","服务人口": "12.35"},
      ]
    }
  }

}
</script>

<style lang="scss" scoped>

</style>
