<template>
  <Table :columns="columns" :dataSource="dataSource" height="280px"/>
</template>

<script>
import Table from "../../../../modules/table";
export default {
  components: {
    Table
  },
  data() {
    return {
      columns: [
        {title: '序号', dataIndex: '序号'},
        {title: '预警时间', dataIndex: '预警时间'},
        {title:'预警地点',dataIndex:'预警地点'},
        {title: '代谢物', dataIndex: '代谢物'},
        {title: '毒品种类', dataIndex: '毒品种类'},
        {title: '预警地址', dataIndex: '预警地址'},
        {title: '绑定设备编号', dataIndex: '绑定设备编号'}
      ],
      dataSource: [
        {"序号": "1", "预警时间": "2021/7/28 11:30","预警地点":"三立泵站" ,"代谢物": "吗啡", "毒品种类": "海洛因","预警地址":"嘉兴市广场路345 号阳光小区13幢","绑定设备编号":"1336463"},
        {"序号": "2", "预警时间": "2021/7/28 11:30", "预警地点":"三立泵站" ,"代谢物": "吗啡", "毒品种类": "海洛因","预警地址":"嘉兴市广场路345 号阳光小区13幢","绑定设备编号":"1336463"},
        {"序号": "3", "预警时间": "2021/7/28 11:30", "预警地点":"三立泵站" ,"代谢物": "吗啡", "毒品种类": "海洛因","预警地址":"嘉兴市广场路345 号阳光小区13幢","绑定设备编号":"1336463"},
        {"序号": "4", "预警时间": "2021/7/28 11:30", "预警地点":"三立泵站" ,"代谢物": "吗啡", "毒品种类": "海洛因","预警地址":"嘉兴市广场路345 号阳光小区13幢","绑定设备编号":"1336463"},
      ]
    }
  }

}
</script>

<style lang="scss" scoped>

</style>
