<template>
  <Table :columns="columns" :dataSource="dataSource" height="160px"/>
</template>

<script>
import Table from "../../modules/table";
export default {
  components: {
    Table
  },
  data() {
    return {
      columns: [
        {title: '区域', dataIndex: '区域'},
        {title: '总数', unit: "", dataIndex: '总数'},
        {title: '已完成', unit: "", dataIndex: '已完成'},
        {title: '未完成', unit: "", dataIndex: '未完成'},
        {title: '完成率', unit: "", dataIndex: '完成率'},
      ],
      dataSource: [
        {"区域": "南湖区", "总数": "63", "已完成": "58", "未完成": "5", "完成率": "92.06%"},
        {"区域": "秀洲区", "总数": "45", "已完成":"40", "未完成": "5", "完成率": "88.99%"},
        {"区域": "嘉善县", "总数": "40", "已完成": "38", "未完成": "2", "完成率": "95.00%"},
        {"区域": "平湖市", "总数": "105", "已完成": "95", "未完成": "10", "完成率": "90.48%"},
        {"区域": "海盐县", "总数": "89", "已完成": "84", "未完成": "5", "完成率": "98.82%"},
        {"区域": "宁海市", "总数": "48", "已完成": "40", "未完成": "8", "完成率": "83.33%"},
        {"区域": "桐乡市", "总数": "153", "已完成": "142", "未完成": "11", "完成率": "92.81%"},
        {"区域": "经开区", "总数": "34", "已完成": "30", "未完成": "4", "完成率": "88.23%"},
        {"区域": "港区", "总数": "59", "已完成": "55", "未完成": "4", "完成率": "93.22%"},
      ]
    }
  }

}
</script>

<style lang="scss" scoped>

</style>
